Web/Web.UI.Automation/load-test/artillery/basictest.yaml
config:
  target: "https://financial-benchmarking-dev.azurewebsites.net"
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/school/detail?urn=102976"
    - get:
        url: "/school/detail?urn=102976&withaction=addtocompare"
    - get:
        url: "/school/detail?urn=102902&withaction=addtocompare"
    - get:
        url: "/school/detail?urn=130604&withaction=addtocompare"
    - get:
        url: "/school/detail?urn=102976&withaction=makedefaultbenchmark"
    - get:
        url: "/benchmarklist"
    - get:
        url: "/school/detail?urn=130597&withaction=makedefaultbenchmark"
    - get:
        url: "/BenchmarkCharts"
    - get:
        url: "/school/detail?urn=102903&withaction=addtocompare"
    - get:
        url: "/benchmarklist?withaction=makedefaultbenchmark&urn=102903"
    - get:
        url: "/benchmarklist?withaction=removefromcompare&urn=102976"
    - get:
        url: "/school/detail?urn=102900&withaction=addtocompare"
    - get:
        url: "/BenchmarkCharts?tab=Expenditure"
    - get:
        url: "/BenchmarkCharts?tab=Income"
    - get:
        url: "/BenchmarkCharts?tab=Balance"
    - get:
        url: "/Errors/NotFound?aspxerrorpath=/ssdkfslk"
    - get:
        url: "/BenchmarkCriteria/ComparisonStrategy?urn=102976"
    - get:
        url: "/BenchmarkCriteria/StepOne?comparisonType=Basic&Urn=102976"
    - get:
        url: "/BenchmarkCriteria/StepOne?comparisonType=Basic&Urn=10297"
    - get:
        url: "/BenchmarkCriteria/SelectSchoolType?BasketSize=4&Urn=10297&ComparisonType=Basic"
    - get:
        url: "/BenchmarkCriteria/SelectSchoolType?BasketSize=31&Urn=10297&ComparisonType=Basic"
    - get:
        url: "/BenchmarkCriteria/StepOne?comparisonType=Advanced&Urn=102976"
    - get:
        url: "/BenchmarkCriteria/StepOne?comparisonType=Advanced&Urn=130597"
    - get:
        url: "/BenchmarkCriteria/ChooseRegion?EstType=Maintained&Urn=130597&ComparisonType=Advanced&BasketSize="
    - get:
        url: "/BenchmarkCriteria/ChooseRegion?EstType=Academy&Urn=130597&ComparisonType=Advanced&BasketSize="
    - get:
        url: "/BenchmarkCriteria/ChooseRegion?EstType=All&Urn=130597&ComparisonType=Advanced&BasketSize="
    - get:
        url: "/BenchmarkCriteria/Characteristics?areaType=All&lacode=&Urn=130597&ComparisonType=Advanced&EstType=all"
    - get:
        url: "/BenchmarkCriteria/Characteristics?areaType=All&lacode=&Urn=139051&ComparisonType=Advanced&EstType=all"
    - get:
        url: "/school/detail?urn=139424"
    - get:
        url: "/school/detail?urn=139051"
    - get:
        url: "/school/detail?urn=139051&tab=Expenditure#charts"
    - get:
        url: "/school/detail?urn=139051&tab=Income#charts"
    - get:
        url: "/school/detail?urn=139051&tab=Balance#charts"
    - get:
        url: "/school/detail?urn=100000"
    - get:
        url: "/school/detail?urn=138150"
    - get:
        url: "/school/detail?urn=130597"
    - get:
        url: "/SchoolSearch/Search?name=&suggestionUrn=&schoolId=&trustname=&trustsuggestionUrn=&locationorpostcode=LU20QB&LocationCoordinates=&searchtype=search-by-location&lacode=&laname=&SelectedLocalAuthorityId="
    - get:
        url: "/SchoolSearch/Search?name=&suggestionUrn=&schoolId=&trustname=&trustsuggestionUrn=&locationorpostcode=London&LocationCoordinates=&searchtype=search-by-location&lacode=&laname=&SelectedLocalAuthorityId="
    - get:
        url: "/SchoolSearch/Search?name=&suggestionUrn=&schoolId=&trustname=&trustsuggestionUrn=&locationorpostcode=Old+Bedford+Road&LocationCoordinates=&searchtype=search-by-location&lacode=&laname=&SelectedLocalAuthorityId="
    - get:
        url: "/SchoolSearch/Search?name=&suggestionUrn=&schoolId=&trustname=&trustsuggestionUrn=&locationorpostcode=&LocationCoordinates=&lacode=821&searchtype=search-by-la-code&laname=&SelectedLocalAuthorityId="
    - get:
        url: "/School/Detail?urn=102976"
    - get:
        url: "/School/Detail?urn=113190"
    - get:
        url: "/SchoolSearch/Search?name=Bedford&suggestionUrn=&searchtype=search-by-name&schoolId=&trustname=&trustsuggestionUrn=&locationorpostcode=&LocationCoordinates=&lacode=&laname=&SelectedLocalAuthorityId="
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+desc&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schoollevel=Primary&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schoollevel=Secondary&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?name=&suggestionUrn=&schoolId=&trustname=&trustsuggestionUrn=&locationorpostcode=Birmingham&LocationCoordinates=&searchtype=search-by-location&lacode=&laname=&SelectedLocalAuthorityId="
    - get:
        url: "/SchoolSearch/Search?radius=3&orderby=&ofstedrating=1&name=&searchtype=search-by-location&LocationCoordinates=&locationorpostcode=Birmingham&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?radius=3&orderby=&ofstedrating=2&name=&searchtype=search-by-location&LocationCoordinates=&locationorpostcode=Birmingham&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?radius=3&orderby=&ofstedrating=3&name=&searchtype=search-by-location&LocationCoordinates=&locationorpostcode=Birmingham&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?radius=3&orderby=&ofstedrating=4&name=&searchtype=search-by-location&LocationCoordinates=&locationorpostcode=Birmingham&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Community+School&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Other+Independent+School&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Academy+Converter&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Academy+Sponsor+Led&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Free+Schools&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Further+Education&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&schooltype=Higher+Education+Institutions&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&faith=Does+not+apply&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&faith=None&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&faith=Church+of+England&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"
    - get:
        url: "/SchoolSearch/Search?orderby=EstablishmentName+asc&faith=Methodist&name=Bedford&searchtype=search-by-name&LocationCoordinates=&locationorpostcode=&lacode=&selectionState=0%2C0%2C0"